export const startMessage = (fullName: string): string => {
  return `👋 سلام ${fullName}، به فروشگاه ما خوش آمدید! 🛍️
    
    از اینکه از فروشگاه ما استفاده می‌کنید متشکریم. 💚
    
    📝 لطفا قبل از سفارش محصولات اطلاعات خود شامل شماره تماس، آدرس و ایمیل را در پروفایل خود ذخیره کنید تا خرید شما سریع‌تر و راحت‌تر انجام شود.
    
    🛒 برای شروع خرید، از منوی زیر استفاده کنید.`;
};

export const profileMessage = `\n\n ⚠️ نکته مهم: برای **پیگیری راحت‌تر و سریع‌تر سفارشات**، لطفاً مطمئن شوید که تمام اطلاعات پروفایل شما (شامل **نام و نام خانوادگی**، تلفن، ایمیل و آدرس) به‌طور **کامل و صحیح** ثبت شده باشد.

❌ عدم تکمیل اطلاعات یا نداشتن نام کاربری، پیگیری سفارش شما را با تأخیر جدی همراه خواهد کرد.

📋 **همه سفارشات آینده بر اساس اطلاعات فوق ارسال خواهند شد.**`;
